//整数的范围
//如何推算,
//越界了会怎样 
/* 
 1字节(8位),
 可表达的是 00000000  ---  11111111
 00000000 --> 0
 11111111 ~~~ 10000000  ---> -1  ~ -128
 00000001 ~~~ 01111111  ---> 1 ~ 127 
*/
  
  
  /*
  char:	 	1字节:  -128 ~ 127
  short:	2字节:  -32768 ~ 32768
  int: 取决于编译器(cpu),通常意义上是'一个字 ' -2(32-1)~2(32-1)-1 
  long:		4字节
  long long : 8字节 
  */
  
  
  /*11111111  纯二进制是255,但当作补码时,是-1; 
  同理:对于-a,其补码是0-a,实际是2的n次方-a,  n是这种类型的位数 */
  
  /* unsigned  无符号的 
  如果一个字面量常数想要表达自己是unsigned,可以在后面加u或U
  	eg:255U
  用l或L表示long(long)
  *unsigned的初衷并非扩展尾数能表达的范围,而是为了做纯二进制运算,主要为了移位 
  在正数时会扩大一倍,不能表达负数    
   */
   
   /*
   整数越界
   整数是以纯二进制方式进行计算的,so
   	11111111 + 1  --> 100000000 --> 0
	01111111 + 1  --> 10000000  --> -128
	10000000 - 1  --> 01111111  --> 127
	
	*/
#include <stdio.h>

int main() 
{
	unsigned char c = 255;  // -1  加上unsigned时
	int i  = 255;
	c = c+1;
	printf("c = %d, i = %d\n",c, i);
	
	return 0;
}
